Akhil-Titus/bare-metal-stm32/3-i2c_adxl345/i2c/i2c.c
#include "stm32f1xx.h"



// #define GPIOBEN                 (1U << 3)   // enable gpio B (look into APB2 peripheral clock enable)
// #define I2C1EN                  (1U << 21)  // enable i2c1 (look into RCC_APB1ENR)

#define I2C_100KHZ              80          // check again
// #define SD_MODE_MAX_RISE_TIME   17          // check agin
// #define CR1_PE                  (1U << 0)   




/*
* Refer pin definitions in data sheet
* Pin out
* PB6 --scl
* PB7 --sda
**/

void i2c1_init(void)
{
    /* enable clock access to gpio B*/
    // RCC->APB2ENR |= GPIOBEN;
    RCC->APB2ENR |= RCC_APB2ENR_IOPBEN;

    /* Set PB6 & PB7 output type to open drain */
    /* Set PB6 & PB7 mode to alternate functions as i2c GPIOx_CRL*/

    // PB6
    // 1. first choose mode as output
    // 2. if mode is output, the cnf reg can be set to make the port alternate function

    // GPIOB->CRL |= GPIO_CRL_MODE6_0 | GPIO_CRL_MODE6_1; // Output Mode "01", 10Mhz GPIOx_CRL since pins in 0 -7 range
    // PB6 mode 01
    GPIOB->CRL |= GPIO_CRL_MODE6_0;
    GPIOB->CRL &= ~GPIO_CRL_MODE6_0;

    GPIOB->CRL |= GPIO_CRL_CNF6_1 | GPIO_CRL_CNF6_1; // Open drain alternate mode 11

    // PB7
    // 1. first choose mode as output
    // 2. if mode is output, the cnf reg can be set to make the port alternate function
    // GPIOB->CRL |= GPIO_CRL_MODE7_0 | GPIO_CRL_MODE7_1; // Output Mode "01", 10Mhz GPIOx_CRL since pins in 0 -7 range
    // PB7 mode 01
    GPIOB->CRL |= GPIO_CRL_MODE7_0;
    GPIOB->CRL &= ~GPIO_CRL_MODE7_1;

    GPIOB->CRL |= GPIO_CRL_CNF7_1 | GPIO_CRL_CNF7_1; // Open drain alternate mode 11

    /* enable pull up for PB6 & PB7 */

    /* Enable clock access to i2c1 */
    // RCC->APB1ENR |= I2C1EN;     // enable i2c1
    RCC->APB1ENR |= RCC_APB1ENR_I2C1EN;

    /*enter reset mode*/
    // I2C1->CR1 |= (1U<<15);
    I2C1->CR1 |= I2C_CR1_SWRST;

    /*come out of reset mode*/
    // I2C1->CR1 &= ~(1U<<15);
    I2C1->CR1 |= I2C_CR1_SWRST;

    /*Set peripheral clock freq*/
    // I2C1->CR2 = (1U<<4);        // 16 MHz 2^4 = 16
    I2C1->CR2 &= ~I2C_CR2_FREQ_4;

    /*Set I2C to standard mode, 100Khz clock
    * Frequency = 1/Time period 
    * 100 = 1/Time period
    * Time Period=CCR×TPCLK1        (TPCLK1  = 125ns)
    * time period = 1/ frequency ie 1/100khz = 1000 ns
    * CCR = 1000ns / 125ns = 80
    * 
    * */
    I2C1->CCR =  I2C_100KHZ;
    // I2C1->CCR = I2C_CCR_CCR;         ??

    /*Set rise time*/
    // I2C1->TRISE |= SD_MODE_MAX_RISE_TIME;
    I2C1->TRISE = I2C_TRISE_TRISE;

    /*Peripheral enable*/
    // I2C1->CR1 |= CR1_PE;
    I2C1->CR1 |= I2C_CR1_PE;
}

void i2c1_byte_read(char sAddr, char mAddr, char *data)
{
    volatile int tmp;

    // wait until bus not busy
    while (I2C1->SR2 & I2C_SR2_BUSY);

    // Start condition
    I2C1->CR1 |= I2C_CR1_START;

    // wait until start bit is set
    while (!(I2C1->SR2 & I2C_SR1_SB));

    /* transmit slave address + write*/
    I2C1->DR = sAddr << 1;      // here LSB will be 0

    /* wait until addr flag is set*/
    while (!(I2C1->SR1 & I2C_SR1_ADDR));

    /* Clear the address flag by reading the SR2 */
    tmp = I2C1->SR2;

    /* Send memory address */
    I2C1->DR = mAddr;

    /* Wait until transmitter is empty*/
    while (!(I2C1->SR1 & I2C_SR1_TXE));

    
    /***************************************
    * Generate restart
    */
    I2C1->CR1 |= I2C_CR1_START;

    // wait until start bit is set
    while (!(I2C1->SR2 & I2C_SR1_SB));

    /* transmit slave address + read*/
    I2C1->DR = sAddr << 1 | 1;      // | operation to make LSB to 1

    /* wait until addr flag is set*/
    while (!(I2C1->SR1 & I2C_SR1_ADDR));

    /* Disable the acknowledge*/
    I2C1->CR1 &= ~I2C_CR1_ACK;

    /* Clear the address flag by reading the SR2 */
    tmp = I2C1->SR2;

    /* Generte a stop after data is received*/
    I2C1->CR1 |= I2C_CR1_STOP;

    /* Wait until receiver flag is set*/
    while (!(I2C1->SR1 & I2C_SR1_RXNE));

    /* Read from data register*/
    *data++ = I2C1->DR;
}

void i2c1_burst_read(char sAddr, char mAddr, int n, char* data)
{
    volatile int tmp;

    // wait until bus not busy
    while (I2C1->SR2 & I2C_SR2_BUSY);

    // Start condition
    I2C1->CR1 |= I2C_CR1_START;

    // wait until start bit is set
    while (!(I2C1->SR2 & I2C_SR1_SB));

    /* transmit slave address + write*/
    I2C1->DR = sAddr << 1;   

    /* wait until addr flag is set*/
    while (!(I2C1->SR1 & I2C_SR1_ADDR));

    /* Clear the address flag by reading the SR2 */
    tmp = I2C1->SR2;

    /* Send memory address */
    I2C1->DR = mAddr;

    /* Wait until transmitter is empty*/
    while (!(I2C1->SR1 & I2C_SR1_TXE));

    
    /***************************************
    * Generate restart
    */
    I2C1->CR1 |= I2C_CR1_START;

    // wait until start bit is set
    while (!(I2C1->SR2 & I2C_SR1_SB));

    /* transmit slave address + read*/
    I2C1->DR = sAddr << 1 | 1;      // | operation to make LSB to 1

    /* wait until addr flag is set*/
    while (!(I2C1->SR1 & I2C_SR1_ADDR));

    /* Clear the address flag by reading the SR2 */
    tmp = I2C1->SR2;

    /* Enable the acknowledge*/
    I2C1->CR1 |= I2C_CR1_ACK;

    while(n > 0U)
    {
        /* if one byte */
        if(n == 1U)
        {
            /* Disable the acknowledge*/
            I2C1->CR1 &= ~I2C_CR1_ACK;

            /* Generte stop*/
            I2C1->CR1 |= I2C_CR1_STOP;

            /* Wait until receiver flag is set*/
            while (!(I2C1->SR1 & I2C_SR1_RXNE));

            /* Read from data register*/
            *data++ = I2C1->DR;

            break;
        }
        else
        {
            /* Wait until receiver flag is set*/
            while (!(I2C1->SR1 & I2C_SR1_RXNE));

            /* Read from data register*/
            *data++ = I2C1->DR;

            n--;
        }
    }
}

void i2c1_burst_write(char sAddr, char mAddr, int n, char* data)
{
    volatile int tmp;

     // wait until bus not busy
    while (I2C1->SR2 & I2C_SR2_BUSY);

    // Start condition
    I2C1->CR1 |= I2C_CR1_START;

    // wait until start bit is set
    while (!(I2C1->SR2 & I2C_SR1_SB));

     /* transmit slave address + write*/
    I2C1->DR = sAddr << 1;   

    /* wait until addr flag is set*/
    while (!(I2C1->SR1 & I2C_SR1_ADDR));

    /* Clear the address flag by reading the SR2 */
    tmp = I2C1->SR2;

    /* Wait until transmitter is empty*/
    while (!(I2C1->SR1 & I2C_SR1_TXE));

    /* Send memory address */
    I2C1->DR = mAddr;

    for (int i = 0; i < n; i++)
    {
        /* Wait until transmitter is empty*/
        while (!(I2C1->SR1 & I2C_SR1_TXE));

        I2C1->DR = *data++;
    }

    /* Wait until transfer id finished*/
    while (!(I2C1->SR1 & I2C_SR1_BTF));

    /* Generte stop*/
    I2C1->CR1 |= I2C_CR1_STOP;
}


void i2c_module_test_function_led(void)
{
    const uint32_t PIN_13 = GPIO_ODR_ODR13; // Alias for pin 13

    // Your code here
    RCC->APB2ENR |= RCC_APB2ENR_IOPCEN;

    GPIOC->CRH |= GPIO_CRH_MODE13_0 | GPIO_CRH_MODE13_1;
    GPIOC->CRH &= ~(GPIO_CRH_CNF13_0 | GPIO_CRH_CNF13_1);

    while (1)
    {
        GPIOC->ODR ^= PIN_13;
        for (int i = 0; i < 500000; i++)
            ;
    }
}